<template>
  <div class="_doc _hideScrollbar _not_viewport">
    <div class="_title">以钛箱会员服务协议</div>
    <!-- <div class="_logo">
      <img :src="$cdn + '/mobile/doc_logo.png'" alt="" />
    </div> -->
    <div class="_content_text">
      <div class="_list" v-for="(item, index) in docList" :key="index">
        <div class="_tit" v-if="item.tit">{{ item.tit }}</div>
        <div class="_cont" v-if="item.desc">
          <div class="_block" v-for="(e, j) in item.desc" :key="j">
            <div class="_cont_t1" v-if="e.txt1" v-html="e.txt1"></div>
            <div class="_cont_t2" v-if="e.txt1_1" v-html="e.txt1_1"></div>
            <div class="_cont_t3" v-if="e.txt2" v-html="e.txt2"></div>
          </div>
        </div>
        <div class="_txt1" v-if="item.txt1" v-html="item.txt1"></div>
        <div class="_txt2" v-if="item.txt2" v-html="item.txt2"></div>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  data() {
    return {
      docList: [
        {
          tit: "特别提示",
          txt2: `本协议系由深圳库链科技有限公司（（以下简称“库链科技”）及所有使用以钛箱会员服务的主体（包括但不限于个人、团队等）（以下简称“用户”）对以钛箱会员服务的使用及相关服务所订立的有效合约。 为使用以钛箱会员服务（简称为：本服务），请您仔细阅读、理解并遵守《以钛箱会员服务协议》（简称为：本协议）。本协议由您与以钛箱会员服务协议提供方共同缔结，具有合同效力。<span class='_bold'> 协议中存在相关免除或限制责任的相应条款（以下称“免责条款”）、对用户权利进行限制的条款（以下称“限制条款”）、约定争议解决方式和司法管辖的条款。前述，该等免责、限制及争议解决方式和管辖条款可能以加粗、颜色标记或其他合理方式提示您注意，并请您重点阅读，您对该等条款的确认将可能导致您在特定情况下的被动、不便、损失，请您在确认同意本协议之前或在使用以钛箱会员服务协议之前再次阅读前述条款。</span>`,
        },
        {
          tit: "一、定义和说明",
          desc: [
            {
              txt1: `1.1【以钛箱会员及帐号】`,
              txt2: `您如果需要使用和享受以钛箱会员服务，则您需要将您享有合法使用权的以钛箱帐号作为会员帐号，并在充值（含接受赠送）后享受跟充值额度相应的会员服务，您即成为以钛箱会员用户。本条款下又称“您”、 “用户”或“会员”。 <span class='_bold'>以钛箱会员是权益内容的会员服务，请您仔细阅读权益内容开通相应的服务。</span>`,
            },
            {
              txt1: `1.2【本服务】`,
              txt2: `以钛箱会员服务，即会员可在以钛箱应用内专享的会员权益及特色服务，包括但不限于椭圆曲线加密（ECC）、非对称加密（RSA）、分布式存储、不可篡改、数字继承等，具体内容以以钛箱“会员服务”页面中描述为准。 <span class='_bold'>不同会员套餐可享受的权益及服务时长会有差异。</span>`,
            },
            {
              txt1: `1.3【以钛箱会员规则】`,
              txt2: `即以钛箱服务提供方不时发布并修订的关于以钛箱会员的用户守则、活动规则、使用规则、公告、提示、通知等内容。`,
            },
            {
              txt1: `1.4【协议更新】`,
              txt2: `<span class=''>库链科技可以对本协议下服务条款进行更新（包含变更、增加、减少相应的条款内容），一旦服务条款发生更新，库链科技会通过以钛箱官方网站、深圳库链科技公众号通知和提醒您注意。如果您不同意变更后的协议，可以停止对本服务的使用。您继续使用库链科技提供的服务，则视为您已经接受本协议的全部修改。</span>`,
            },
            {
              txt1: `1.5【本协议】`,
              txt2: `<span class='_bold'> 本协议内容同时包括库链科技可能不断发布的关于以钛箱服务的相关协议、业务规则等内容。</span>`,
            },
          ],
        },
        {
          tit: "二、帐号管理及使用规则",
          desc: [
            {
              txt1: `2.1 【帐号管理】`,
              txt2: `2.1.1 您应正确使用及妥善保管、维护您的以钛箱助记词，如发生任何泄漏、遗失、被盗等行为，而该等行为并非库链科技法定过错导致，所有损失将由您自行承担；`,
            },
            {
              txt1: `2.2 【使用规则】`,
              txt1_1: `2.2.1【合法获取及使用】`,
              txt2: `(1) 以钛箱会员服务 ，均仅限于您在以钛箱平台内使用，任何以破解、转译、转录等非法手段将以钛箱服务与以钛箱平台分离的行为，均不属于本条款中约定的以钛箱会员服务。库链科技保留追究侵权人的法律责任及索赔的权利。`,
            },
            {
              txt1_1: `(2) 任何以盗窃、利用系统漏洞、通过任何非库链科技官方或授权途径获得的以钛箱会员服务（包括但不限于购买、租用、借用、分享、受让等方式获得）、恶意利用或破坏以钛箱会员活动获得的会员服务，均不获相关保护，库链科技有权取消或不予提供会员服务，所有产生的损失及责任由行为人自行承担。`,
            },
            {
              txt1_1: `(3) 使用以钛箱会员服务及参加相关活动时，亦应通过以钛箱官方公布/授权的方式进行，<span class=''>用户通过其他任何渠道、任何途径、任何方式非法获取的以钛箱会员服务（包括且不限于帐号、会员权益、会员服务激活码等）或参加活动获取福利（包括但不限于获得实体/虚拟礼品、会员权益、会员服务激活码等），均不获保护，且一经发现库链科技有权立即就相关服务做出限制等处理，所有产生的损失及责任由行为人自行承担。</span>`,
            },
            {
              txt1_1: `<span class='_bold'>(4) 您参加会员活动时，应按照活动规则、以合法及不损害活动举办方的方式进行，利用系统漏洞、规则设置缺陷、系统设置错误、滥用会员身份等参加活动并获取相关福利的，均不获保护，且库链科技有权采取相关措施进行处理，所有产生的损失及责任由行为人自行承担。</span>`,
            },
          ],
        },

        {
          tit: null,
          desc: [
            {
              txt1: `2.2.2 【专有及非商业目的使用】`,
              txt1_1: `(1) 以钛箱会员服务，是在您遵守本条款及相关法律法规的前提下，库链科技给予您一项个人的、不可转让及非排他性的许可。您仅可为非商业目的使用，并仅可用作私人使用。`,
            },
            {
              txt1_1: `<span class='' >(2) 您理解并同意，您不得将享有会员服务的以钛箱账号以任何方式提供给他人使用，包括但不限于不得以转让、出租、借用、分享、出售等方式提供给他人作包括但不限于分享、上传、参加活动等使用。否则，因此产生任何法律后果及责任均由您自行承担，且库链科技有权中止或终止对您提供服务。</span>`,
            },

            {
              txt1: `2.2.3 【帐号独立】`,
              txt1_1: `(1) 同一主体拥有多个以钛箱帐号并进行以钛箱会员登录的，每一个以钛箱帐号将被识别为一个独立的帐号。`,
            },

            {
              txt1_1: `<span class='_bold'>(2) 每个以钛箱帐号之间的数据无法进行转移、迁徙、转让、赠与、售卖、租借、分享，无论该等帐号是否由同一使用人拥有，请您在登录或参加活动时注意区分，避免造成损失。</span>`,
            },

            {
              txt1: `2.2.4 【登录限制】`,
              txt1_1: `<span class=''>您理解并同意，在开通本服务后，同一个帐号最多可以在多个设备（“设备”指包括但不限于计算机及移动电话、平板电脑等手持移动终端设备，下同）上使用，且同一时间内同一帐号最多在两个设备上使用。</span>`,
            },
            {
              txt1: `2.2.5 【帐号找回】`,
              txt1_1: `<span class='_bold'>您进入以钛箱时使用的助记词信息遗失、忘记，导致无法进入以钛箱的，您将永远无法找回。</span>`,
            },
            {
              txt1: `2.2.6 【谨慎操作】`,
              txt1_1: `<span class='_bold'>以钛箱向您提供数据存储、管理和传承等在线服务，您完全拥有、控制存储在自己区块链空间里的数据，并自行对存储的数据进行编辑等操作。如您自行删除并清空所存储的数据，以钛箱区块数据将同步删除您的在线数据，按照您的指令不再保留该数据。就数据的删除、清空等操作，您应谨慎操作。</span>`,
            },
          ],
        },

        {
          tit: "三、会员服务内容",
          desc: [
            {
              txt1: `3.1 【会员特权】`,
              txt1_1: `3.1.1 在您开通会员服务后，根据您的购买记录及您参加的相关活动，将会享有对应服务体验，具体以相关服务页面公布、实际提供的内容为准。`,
            },
            {
              txt1_1: `<span class='' >3.1.2 您在购买以钛箱会员后可享受的全部权益以以钛箱官方网站公布的会员权益为准，库链科技有权基于自身业务发展需要变更全部或部分会员权益。就前述权益调整以钛箱会通过在相应服务页面更新展示或通知、提醒您注意，您也可通过以钛箱官方网站或深圳库链科技公众号查询最新的会员权益内容。同时我们也鼓励您定期查看本协议内容，以更好地保障您的权益。</span>`,
            },

            {
              txt1: `3.2 【虚拟产品】`,
              txt1_1: `<span class='_bold' >基于虚拟产品的性质和特征，您所获取的虚拟产品不能够进行退货、换货、兑换现金，亦不得用于商业领域，如买卖、置换、抵押等。为了保证您的用户权益，请您通过官方渠道购买以钛箱会员产品，一切通过非官方公布渠道取得的虚拟产品及其衍生服务均不获保护，库链科技有权中止或终止对您的服务；由此带来的损失，以钛箱不承担相关责任。</span>`,
            },

            {
              txt1: `3.3 【设备及系统差异】`,
              txt1_1: `<span class='_bold'>您通过库链科技指定渠道开通本服务后，可能会由于您使用的软件版本、设备、操作系统等不同以及其他第三方原因等导致您实际可使用的具体服务有差别，由此可能给您带来的不便，您表示理解，您不予追究或者豁免库链科技的相关责任。</span>`,
            },

            {
              txt1: `3.4 【关于收费】`,
              txt1_1: `本服务是库链科技提供的收费服务，您须在按照本服务的收费标准支付相应费用后，方可使用本服务。此外，您也可以通过接受好友赠送等库链科技认可的其他方式享有、使用本服务。 <span class='_bold'>库链科技可能会根据本服务的整体规划，对本服务相关权益细则、收费标准、方式等进行修改和变更，前述修改、变更，库链科技将在相应服务页面进行更新展示。库链科技会根据实际状况，对不同阶段充值、续费的会员给予不同的优惠，具体优惠政策以库链科技在相关服务页面公示的信息为准。同时我们也鼓励您定期查看本协议内容，以更好地保障您的权益。 您在此理解并同意因参加活动不同或会员套餐不同，以钛箱会员将享受不同的增值服务或资费。`,
            },
            {
              txt1: `3.5 【支付】`,
              txt1_1: `3.5.1 您应该通过库链科技指定的包括但不限于支付宝支付、微信支付等方式等现有方式或今后库链科技指定方式，依约支付。 <span class='_bold'>支付完成后，不可进行转让或退款。除非因以钛箱产品技术原因，导致您购买时被重复扣款，您可提出退款申诉，经过库链科技核实后可为您办理退款，但您需要提供相应信息并配合库链科技处理。</span>`,
            },
            {
              txt1_1: `3.5.2 您不得通过以下任何方式为自己或他人开通本服务：`,
            },
            {
              txt2: `(1) 以营利、经营等非个人使用的目的为自己或他人开通本服务；`,
            },
            {
              txt2: `(2) 通过任何机器人软件、蜘蛛软件、爬虫软件、刷屏软件等任何程序、软件方式为自己或他人开通本服务；`,
            },
            {
              txt2: `(3) 通过任何不正当手段或以违反诚实信用原则的方式为自己或他人开通本服务；`,
            },
            {
              txt2: `(4) 通过非库链科技指定的方式为自己或他人开通本服务；`,
            },
            {
              txt2: `(5) 通过侵犯库链科技或他人合法权益的方式为自己或他人开通本服务；`,
            },
            {
              txt2: `(6) 通过其他违反相关法律、行政法规、国家政策等的方式为自己或他人开通本服务；`,
            },

            {
              txt1_1: `3.5.3 <span class='_bold'>您理解并认可，如果您通过第三方支付工具在我方平台账户支付或充值后可能产生的任何商业风险（包括但不限于不法分子利用您账户或银行卡等有价卡等进行违法活动，第三方代为充值后再退款导致您的会员权益无法实现；采用第三方黑产渠道代为充值，或通过第三方非正规渠道购买远低于市场价值的以钛箱会员权益等），该等风险均有可能给您造成相应的经济损失，我方在充分履行其在本协议项下义务和符合法律规定的前提下，在法律有明确规定的情况和范围内，承担相应的责任。</span>`,
            },

            {
              txt1_1: `3.6 【服务期限】`,
            },
            {
              txt1_1: `3.6.1 除本协议另有约定外，本服务的期限以您自行选择并支付相应服务费用的期限为准，自您选择并购买本服务后生效，直至服务到期或您终止本服务/注销会员资格时终止，您也可以登陆以钛箱会员中心或者本服务的相应页面查询。<span class=''>如您希望享受会员服务连续采购和自动扣费的服务，您可以根据操作指引向提出申请；`,
            },
            {
              txt1_1: `<span class=''>3.6.2 请您理解，由于互联网服务的特殊性，为向您提供优质服务，以钛箱须不定时进行服务器的维修、调整、升级等，且在黑客攻击、计算机病毒侵入、监管机构政策通知等不可抗力事件发生后，以钛箱须解决故障并处理相关侵权事宜，因此您接受，本服务的服务期限包含以钛箱解决故障、节点升级、因第三方侵权处理等所需的合理时间，库链科技对上述情况所需用的时间不另行补偿。</span>`,
            },

            
          ],
        },

        {
          tit: "四、违约责任",
          desc: [
            {
              txt1: `4.1 您在使用本服务的过程中，不得进行以下违约行为：`,
              txt1_1: `4.1.1 违反本条款约定的；`,
            },
            {
              txt1_1: `4.1.2 违反法律、法规、规章、条例以及任何具有法律效力之规范规定的；`,
            },

            {
              txt1_1: `4.1.3 破坏、影响库链科技对任何第三方提供本服务；`,
            },

            {
              txt1_1: `4.1.4 进行危害计算机网络安全的行为；`,
            },
            {
              txt1_1: `<span class=''>4.1.5 对库链科技及关联第三方（包括授权方和合作方）提供的本条款服务、活动造成不良影响，侵犯及或关联第三方库链科技及或其他用户的正当利益；</span>`,
            },

            {
              txt1_1: `4.1.6 被有权机构认定侵犯任何第三方的合法权益的；`,
            },
            {
              txt1_1: `4.1.7 利用本服务获取非法利益的，包括但不限于通过转售、转让、转授权等行为不正当牟利；`,
            },
            {
              txt1_1: `4.1.8 其他侵犯库链科技合法利益的行为；`,
            },

            {
              txt1: `4.2 【违约行为处理】`,
              txt1_1: `<span class='_bold'>您确认并同意，如果库链科技发现或收到他人举报您有违反本协议任何行为的，库链科技有权依法进行独立判断并采取以下一项或多项措施处理：</span>`,
            },
            {
               txt1_1: `<span class='_bold'>(1) 根据相应规则立即删除、屏蔽或断开相关的信息；</span>`,
            },
            {
              txt1_1: `<span class='_bold'>(2) 采取包括但不限于中止或终止部分或全部本服务的措施；</span>`,
            },
            {
              txt1_1: `<span class='_bold'>(3) 采取扣除违约行为发生时间内的会员权益时长的措施；</span>`,
            },
            {
              txt1_1: `<span class='_bold'>(4) 采取限制用户上传、下载、播放、分享、存储等权益的措施；</span>`,
            },
            {
              txt1_1: `<span class='_bold'>(5) 库链科技无需向您退还任何费用，未使用的服务费用作为违约金归库链科技所有，您的相关会员权益的损失由您自行承担，库链科技在法律有明确规定的情况下承担相应的责任。</span>`,
            },
            // {
            //   txt1_1: `<span class='_bold'></span>`,
            // },

            {
              txt1: `4.3 【赔偿责任】`,
              txt1_1: `<span class='_bold'>如您的行为使库链科技及/或其关联公司遭受损失（包括自身的直接经济损失、商誉损失及对外支付的赔偿金、和解款、律师费、诉讼费等间接经济损失），您应赔偿库链科技及或其关联公司的上述全部损失。</span>`,
            },
            {
              txt1_1: `<span class='_bold'>如您的行为使库链科技及或其关联公司遭受第三人主张权利，库链科技及或其关联公司可在对第三人承担金钱给付等义务后就全部损失向您追偿。</span>`,
            },
          ],
        },

        {
          tit: "五、服务的变更、中止及终止",
          desc: [
            {
              txt1: `5.1 本服务的中止或终止包含如下情况：`,
              txt1_1: `5.1.1用户主动中止或终止，包括但不限于会员到期未进行续费等；`,
            },
            {
              txt1_1: `5.1.2 因为用户违约行为，库链科技主动中止或终止服务的；`,
            },

            {
              txt1_1: `5.1.3 因国家或相关部门要求或发生不可抗力事件时，库链科技中止或终止服务的；`,
            },

            {
              txt1_1: `5.1.4 其他根据法律法规或库链科技业务调整等应当或者需要中止或终止服务的；`,
            },
            {
              txt1: `<span class=''>5.2 中止或终止服务后，以钛箱将尽最大努力通过合理方式通知用户。当您发现无法登录或享受服务时，可以咨询我们的客服。</span>`,
            },

            {
              txt1: `5.3 中止或终止后的处理:`,
              txt1_1: `<span class=''>5.3.1 除法律规定的责任外，库链科技对本服务的中止或终止对用户和任何第三人不承担任何责任；</span>`,
            },
            {
              txt1_1: `<span class=''>5.3.2 除法律规定或本协议另有约定外，已收取的费用不予退还；</span>`,
            },
            {
              txt1: `<span class=''>5.4 以钛箱依据本协议的约定变更服务内容、服务方式以及本协议内容的，如果会员不同意以钛箱的变更，有权选择取消并停止使用已经获取的对应的全部或部分服务；如果会员继续使用以钛箱提供的上述服务，则视为会员已经接受以钛箱的上述调整。</span>`,
            },
            {
              txt1: `<span class=''>5.5 会员如果不同意条款的修改，可主动向以钛箱提出终止会员服务，但以钛箱不退还自开通会员服务日起的所有已付费用，如果会员继续享用会员服务，则视为会员已经接受条款的修改。</span>`,
            },

            // {
            //   txt1_1: `<span class='_bold'></span>`,
            // },
          ],
        },

        {
          tit: "六、免责声明",
          desc: [
            {
              txt1: `<span class=''>6.1 您知悉并同意，用户在以钛箱平台上上传、发布或传输的内容，为用户的个人行为，库链科技不对该等信息和内容的准确性、真实性、可用性、安全性、完整性和正当性承担责任，您在此同意豁免追加库链科技的相关责任。</span>`,
            },
            {
              txt1: `<span class=''>6.2 您在进行相关信息及内容的使用、分享、下载等行为（以下简称“使用行为”）时，应进行独立判断并合法使用，因您的使用行为造成任何自身损害及对第三方的损害，库链科技不承担任何责任。</span>`,
            },
            {
              txt1: `<span class=''>6.3 因电信和网通部门的通讯线路故障、网络或电脑故障、系统不稳定、不可抗力（如所有节点服务器宕机）等非库链科技原因造成您帐号、帐号内财产等丢失、减少的，您无权要求库链科技承担补偿等责任。</span>`,
            },
            {
              txt1: `<span class=''>6.4 您在使用以钛箱所提供的服务时，如遭受任何人身或财务的损失、损害或伤害，除法律有明确规定外，库链科技不承担任何责任。由于您将个人助记词告知他人或与他人共享使用权利，由此导致的任何个人资料泄露，库链科技不承担任何责任。</span>`,
            },
          ],
        },

        {
          tit: "七、通知和送达",
          desc: [
            {
              txt1: `本协议项下库链科技对于用户所有的通知均且只通过以钛箱官方网站或深圳库链科技公众号进行，该等通知于发送之日视为已送达用户。`,
            },
          ],
        },

        {
          tit: "八、法律的适用和管辖",
          desc: [
            {
              txt1: `8.1 本协议的订立、执行和解释及争议的解决均应适用中华人民共和国和所在国法律。`,
            },
            {
              txt1: `<span class=''>8.2 如双方就本协议内容或其执行发生任何争议，双方应尽量友好协商解决；协商不成时，任何一方均可向库链科技所在地有管辖权的人民法院提起诉讼。</span>`,
            },
            {
              txt1: `8.3 库链科技未行使或执行本服务协议任何权利或规定，不构成对前述权利或权利之放弃。`,
            },
            {
              txt1: `8.4 如本协议中的任何条款无论因何种原因完全或部分无效或不具有执行力，本协议的其余条款仍应有效并且有约束力。`,
            },

            {
              txt1: `<span class='_bold'>8.5 在法律法规允许的范围内，库链科技有权对本协议进行解释。 </span>`,
            },
          ],
        },
      ],
    };
  },
};
</script>

<style scoped lang='scss'>
._doc._not_viewport {
  background: #000000;
  height: initial;
  // overflow-y: auto;
  ._title {
    font-size: 24px;
    font-family: PingFangSC-Medium, PingFang SC;
    font-weight: 500;
    color: #ffffff;
    line-height: 33px;
    padding: 32px 0 17px 0;white-space:pre-wrap;    word-break: normal;
  }
  ._logo {
    width: 100%;
    height: 240px;
    img {
      height: 240px;
    }
  }
  ._content_text {
    ._list {
      padding: 0 14px;
      text-align: left;
      padding-bottom: 30px;white-space:pre-wrap;    word-break: normal;
      ._tit {
        height: 30px;
        font-size: 18px;
        font-family: PingFangSC-Medium, PingFang SC;
        font-weight: 500;
        color: #ffffff;
        line-height: 30px;
        text-align: left;
        padding-bottom: 18px;
        padding-top: 5px;white-space:pre-wrap;    word-break: normal;
      }
      ._txt2 {
        font-size: 12px;
        font-family: PingFangSC-Regular, PingFang SC;
        font-weight: 400;
        color: #ffffff;
        line-height: 22px;white-space:pre-wrap;    word-break: normal;
      }
      ._cont {
        ._block {
          padding-bottom: 10px;white-space:pre-wrap;    word-break: normal;
        }
        ._cont_t1 {
          font-size: 12px;
          font-family: PingFangSC-Medium, PingFang SC;
          font-weight: 500;
          color: #ffffff;
          line-height: 22px;
          padding: 6px 0;white-space:pre-wrap;    word-break: normal;
        }
        ._cont_t3,
        ._cont_t2 {
          font-size: 12px;
          font-family: PingFangSC-Medium, PingFang SC;
          font-weight: 500;
          color: #ffffff;
          line-height: 22px;white-space:pre-wrap;    word-break: normal;
        }
      }
    }
  }
  
}
</style>